INSERT INTO faculty
VALUES (default, 100, 'ИТМ'),
	(default, 200, 'ИИМРТ'),
	(default, 300, 'ФАДЭТ'),
	(default, 400, 'АВИЭТ'),
	(default, 500, 'ИХЗЧС');
	
INSERT INTO education_level
VALUES (default, 'Бакалавриат'),
	(default, 'Магистратура'),
	(default, 'Специалитет'),
	(default, 'Аспирантура');
	
INSERT INTO education_form
VALUES (default, 'О', 'Очная'),
	(default, 'ОЗ', 'Очно-Заочная'),
	(default, 'З', 'Заочная');
	
INSERT INTO specialize
VALUES (default, 1, '15.03.04', '2142', 'Автоматизация технологических процессов и производств', 1),
	(default, 2, '09.03.01', '1247', 'Информатика и вычислительная техника', 1),
	(default, 2, '09.03.04', '1268', 'Программная инженерия', 1),
	(default, 3, '24.03.04', '2758', 'Авиастроение', 1),
	(default, 5, '04.03.01', '3481', 'Химия', 1),
	(default, 5, '18.03.01', '3502', 'Химическая технология', 1);
	
INSERT INTO profile
VALUES (default, 1, 'Автоматизация технологических процессов и производств в горной промышленности', '3 years 9 months'),
	(default, 1, 'Роботизированные комплексы', '3 years 9 months'),
	(default, 1, 'Автоматизация технологических процессов и производств в нефтегазопереработке', '3 years 9 months'),
	(default, 2, 'Веб-технологии', '3 years 9 months'),
	(default, 2, 'Интеграция и программирование САПР', '3 years 9 months'),
	(default, 2, 'Программное обеспечение и интеллектуальные системы', '3 years 9 months'),
	(default, 3, 'Разработка программно-информационных систем', '3 years 9 months'),
	(default, 3, 'Технология разработки и сопровождение качественного программного продукта', '3 years 9 months'),
	(default, 3, 'Нейротехнологии и программирование', '3 years 9 months'),
	(default, 4, 'Аналитическая химия', '3 years 6 months'),
	(default, 4, 'Физическая химия', '3 years 6 months'),
	(default, 4, 'Нанокатализаторы химических реакций. Химия нефти.', '3 years 9 months'),
	(default, 5, 'Химическая технология материалов новой техники', '3 years 9 months'),
	(default, 5, 'Химическая технология нефти и газа', '3 years 9 months'),
	(default, 5, 'Технологии химических и нефтеперерабатывающих производств', '3 years 9 months');
	
INSERT INTO education_program
VALUES (default, 1, 1, '2023-09-01'),
	(default, 1, 3, '2023-09-01'),
	(default, 2, 1, '2023-09-01'),
	(default, 3, 1, '2023-09-01'),
	(default, 4, 1, '2023-09-01'),
	(default, 4, 2, '2023-09-01'),
	(default, 4, 3, '2023-09-01'),
	(default, 5, 1, '2023-09-01'),
	(default, 5, 3, '2023-09-01'),
	(default, 6, 1, '2023-09-01'),
	(default, 7, 1, '2023-09-01'),
	(default, 8, 1, '2023-09-01'),
	(default, 9, 1, '2023-09-01'),
	(default, 10, 1, '2023-09-01'),
	(default, 11, 1, '2023-09-01'),
	(default, 12, 1, '2023-09-01'),
	(default, 13, 1, '2023-09-01'),
	(default, 14, 1, '2023-09-01'),
	(default, 15, 1, '2023-09-01');

INSERT INTO group_schedule
VALUES (default),
	(default),
	(default),
	(default),
	(default),
	(default),
	(default),
	(default),
	(default),
	(default),
	(default),
	(default),
	(default);

INSERT INTO student_group
VALUES (default, 101, 'АТПП-101А', 1, 1, 1, '2023-08-30'),
	(default, 102, 'АТПП-102А', 1, 1, 2, '2023-08-30'),
	(default, 111, 'РК-101К', 1, 3, 3, '2023-08-29');
	
INSERT INTO student
VALUES
(DEFAULT, 7546, 2, 'Иванов', 'Алексей', 'Игоревич', 75, 123456789, '2023-08-21 12:30:00'),
(DEFAULT, 3814, 1, 'Смирнова', 'София', NULL, 80, 987654321, '2023-08-22 09:15:00'),
(DEFAULT, 9872, 3, 'Петров', 'Михаил', 'Сергеевич', 60, 456789123, '2023-08-23 16:45:00'),
(DEFAULT, 5632, 2, 'Давыдова', 'Екатерина', NULL, 90, 654321789, '2023-08-24 14:20:00'),
(DEFAULT, 6297, 1, 'Козлова', 'Ольга', NULL, 70, 789123456, '2023-08-25 10:55:00'),
(DEFAULT, 4321, 3, 'Лебедев', 'Алексей', 'Иванович', 85, 321789456, '2023-08-26 13:10:00'),
(DEFAULT, 8231, 2, 'Турченко', 'София', NULL, 95, 789456123, '2023-08-27 17:30:00'),
(DEFAULT, 5478, 1, 'Халатов', 'Даниил', 'Максимович', 55, 123789456, '2023-08-28 11:40:00'),
(DEFAULT, 3210, 3, 'Лебедев', 'Мария', 'Павловна', 78, 456123789, '2023-08-29 15:20:00'),
(DEFAULT, 7894, 2, 'Турченко', 'Валентин', 'Петрович', 73, 789789123, '2023-08-30 09:45:00'),
(DEFAULT, 6543, 1, 'Андреев', 'Анна', 'Ивановна', 80, 456789789, '2023-08-21 14:15:00'),
(DEFAULT, 2654, 3, 'Васильев', 'Ярослав', 'Максимович', 68, 123456789, '2023-08-22 10:30:00'),
(DEFAULT, 4853, 2, 'Романова', 'Лидия', 'Викторовна', 77, 987654321, '2023-08-23 11:45:00'),
(DEFAULT, 9234, 1, 'Турченко', 'Лиам', 'Валентинович', 79, 456789123, '2023-08-24 16:20:00'),
(DEFAULT, 7321, 3, 'Скворцов', 'Изабелла', 'Александровна', 82, 654321789, '2023-08-25 12:55:00'),
(DEFAULT, 5467, 2, 'Бакер', 'Иван', 'Игоревич', 89, 789123456, '2023-08-26 14:10:00'),
(DEFAULT, 3789, 1, 'Турченко', 'София', NULL, 70, 321789456, '2023-08-27 09:30:00'),
(DEFAULT, 7890, 3, 'Уолкер', 'Оливер', 'Николаевич', 75, 789456123, '2023-08-28 13:40:00'),
(DEFAULT, 5643, 2, 'Турченко', 'Геннадий', 'Александрович', 63, 123789456, '2023-08-29 16:20:00'),
(DEFAULT, 1456, 1, 'Перез', 'Амелия', 'Петровна', 72, 456123789, '2023-08-30 11:45:00'),
(DEFAULT, 8745, 3, 'Турченко', 'Грейс', 'Михайловна', 71, 789789123, '2023-08-21 17:15:00'),
(DEFAULT, 6357, 2, 'Кинг', 'Александр', 'Васильевич', 74, 123456789, '2023-08-22 15:30:00'),
(DEFAULT, 9873, 1, 'Турченко', 'Миа', 'Валентиновна', 69, 987654321, '2023-08-23 10:45:00'),
(DEFAULT, 2341, 3, 'Турченко', 'Джек', NULL, 87, 456789123, '2023-08-24 14:20:00'),
(DEFAULT, 4567, 2, 'Турченко', 'Лили', 'Игоревна', 81, 654321789, '2023-08-25 12:55:00'),
(DEFAULT, 7893, 1, 'Турченко', 'Ноа', 'Валентинович', 88, 789123456, '2023-08-26 14:10:00'),
(DEFAULT, 5432, 3, 'Турченко', 'Эмили', 'Александровна', 76, 321789456, '2023-08-27 09:30:00'),
(DEFAULT, 9876, 2, 'Турченко', 'Уильям', NULL, 67, 789456123, '2023-08-28 13:40:00'),
(DEFAULT, 1234, 1, 'Турченко', 'Оливия', NULL, 94, 123789456, '2023-08-29 16:20:00'),
(DEFAULT, 7895, 3, 'Турченко', 'София', NULL, 72, 456123789, '2023-08-30 11:45:00');

INSERT INTO passport
VALUES
(DEFAULT, 1, true, 2345, 123456, '2019-05-15 09:30:00', '—'),
(DEFAULT, 3, true, 4567, 789012, '2016-07-05 11:15:00', '—'),
(DEFAULT, 5, true, 1234, 567890, '2015-08-30 13:20:00', '—'),
(DEFAULT, 7, true, 3456, 890234, '2014-11-18 16:30:00', '—'),
(DEFAULT, 8, true, 2345, 123456, '2012-06-28 08:45:00', '—'),
(DEFAULT, 9, true, 7890, 654321, '2020-03-02 12:10:00', '—'),
(DEFAULT, 10, true, 4567, 789012, '2019-09-07 14:20:00', '—'),
(DEFAULT, 12, true, 1234, 567890, '2018-05-25 11:40:00', '—'),
(DEFAULT, 14, true, 3456, 890234, '2014-08-19 15:10:00', '—'),
(DEFAULT, 16, true, 7890, 654321, '2013-05-05 12:50:00', '—'),
(DEFAULT, 18, true, 5678, 890123, '2017-12-12 09:05:00', '—'),
(DEFAULT, 19, true, 1234, 567890, '2014-07-15 11:15:00', '—'),
(DEFAULT, 20, true, 9876, 123789, '2018-09-22 13:55:00', '—'),
(DEFAULT, 22, true, 2345, 123456, '2013-02-04 08:30:00', '—'),
(DEFAULT, 24, true, 4567, 789012, '2017-11-02 14:15:00', '—'),
(DEFAULT, 26, true, 1234, 567890, '2015-06-22 10:30:00', '—'),
(DEFAULT, 28, true, 3456, 890234, '2019-10-30 16:45:00', '—'),
(DEFAULT, 2, true, 7890, 654321, '2018-12-20 14:45:00', '—'),
(DEFAULT, 4, true, 5678, 890123, '2017-02-10 10:00:00', '—'),
(DEFAULT, 6, true, 9876, 123789, '2013-04-25 15:55:00', '—'),
(DEFAULT, 16, true, 7890, 654321, '2013-05-05 12:50:00', '—'),
(DEFAULT, 22, true, 2345, 123456, '2013-02-04 08:30:00', '—'),
(DEFAULT, 10, true, 4567, 789012, '2019-09-07 14:20:00', '—'),
(DEFAULT, 12, true, 1234, 567890, '2018-05-25 11:40:00', '—'),
(DEFAULT, 13, true, 9876, 123789, '2016-03-14 13:30:00', '—'),
(DEFAULT, 18, true, 5678, 890123, '2017-12-12 09:05:00', '—'),
(DEFAULT, 19, true, 1234, 567890, '2014-07-15 11:15:00', '—'),
(DEFAULT, 20, true, 9876, 123789, '2018-09-22 13:55:00', '—'),
(DEFAULT, 21, true, 3456, 890234, '2019-06-18 16:20:00', '—'),
(DEFAULT, 25, true, 5678, 890123, '2018-04-30 09:45:00', '—'),
(DEFAULT, 26, true, 1234, 567890, '2015-06-22 10:30:00', '—'),
(DEFAULT, 27, true, 9876, 123789, '2016-12-17 13:10:00', '—'),
(DEFAULT, 30, true, 2345, 123456, '2019-05-15 09:30:00', '—'),
(DEFAULT, 29, true, 7890, 654321, '2018-01-15 12:20:00', '—'),
(DEFAULT, 30, true, 5678, 890123, '2017-03-20 14:00:00', '—'),
(DEFAULT, 8, false, 4567, 789012, '2013-09-20 14:40:00', '—'),
(DEFAULT, 5, false, 1234, 567890, '2017-08-05 11:25:00', '—'),
(DEFAULT, 7, false, 3456, 890234, '2018-11-28 15:30:00', '—'),
(DEFAULT, 1, false, 7890, 654321, '2018-01-15 12:20:00', '—'),
(DEFAULT, 4, false, 5678, 890123, '2017-03-20 14:00:00', '—'),
(DEFAULT, 2, false, 7890, 654321, '2018-12-20 14:45:00', '—'),
(DEFAULT, 6, false, 9876, 123789, '2019-05-05 11:10:00', '—'),
(DEFAULT, 3, false, 4567, 789012, '2016-07-05 11:15:00', '—'),
(DEFAULT, 8, false, 4567, 789012, '2013-09-20 14:40:00', '—'),
(DEFAULT, 5, false, 1234, 567890, '2017-08-05 11:25:00', '—'),
(DEFAULT, 7, false, 3456, 890234, '2018-11-28 15:30:00', '—');

INSERT INTO contract
VALUES
(DEFAULT, 1, 12345, '2023-08-12 10:30:00', 'Lorem Ipsum is simply dummy text of the printing and typesetting industry.'),
(DEFAULT, 2, 23456, '2023-08-15 14:45:00', 'It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged.'),
(DEFAULT, 3, 34567, '2023-08-18 09:15:00', NULL),
(DEFAULT, 4, 45678, '2023-08-22 16:45:00', NULL),
(DEFAULT, 5, 56789, '2023-08-25 12:20:00', NULL);
